11/data/attachments/d77727e1440b16a3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Brian_specific_Friend_41207_9</nif:username>
            <nif:friendToBeRequested>soap_friends_d68ab28d-3076-45c5-9efc-575aac863dcc</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>